In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('Dataset/employee_data.csv')

In [4]:
df.head()

   Unnamed: 0  id groups  age  healthy_eating  active_lifestyle  salary
0           0   0      A   36               5                 5    2297
1           1   1      A   55               3                 5    1134
2           2   2      A   61               8                 1    4969
3           3   3      O   29               3                 6     902
4           4   4      O   34               6                 2    3574

In [5]:
df.columns

Index(['Unnamed: 0', 'id', 'groups', 'age', 'healthy_eating',
       'active_lifestyle', 'salary'],
      dtype='object')

In [8]:
df.drop('Unnamed: 0', axis=1, inplace=True)

In [9]:
df.head()

   id groups  age  healthy_eating  active_lifestyle  salary
0   0      A   36               5                 5    2297
1   1      A   55               3                 5    1134
2   2      A   61               8                 1    4969
3   3      O   29               3                 6     902
4   4      O   34               6                 2    3574

# Numeric values grouped by categorical variables

In [12]:
# Age(numerical) -> Categorical 
cut_bins = [0, 21, 50, 75]
cut_labels = ['young', 'middle', 'old']
df['age_cat'] = pd.cut(df['age'], bins = cut_bins, labels = cut_labels)

In [13]:
df.head()

   id groups  age  healthy_eating  active_lifestyle  salary age_cat
0   0      A   36               5                 5    2297  middle
1   1      A   55               3                 5    1134     old
2   2      A   61               8                 1    4969     old
3   3      O   29               3                 6     902  middle
4   4      O   34               6                 2    3574  middle

In [14]:
df['age_cat'].value_counts()

middle    616
old       300
young      84
Name: age_cat, dtype: int64

In [25]:
# Using 'group by' method
mean = df.groupby('age_cat')['salary'].mean()
median = df.groupby('age_cat')['salary'].median()
min = df.groupby('age_cat')['salary'].min()
max = df.groupby('age_cat')['salary'].max()
std = df.groupby('age_cat')['salary'].std()


print(mean)
print(median)
print(min)
print(max)
print(std)

age_cat
young     2176.059524
middle    2289.563312
old       2114.336667
Name: salary, dtype: float64
age_cat
young     2065.0
middle    2179.0
old       2065.0
Name: salary, dtype: float64
age_cat
young     553
middle    553
old       553
Name: salary, dtype: int64
age_cat
young     4508
middle    5550
old       5435
Name: salary, dtype: int64
age_cat
young     1040.247241
middle    1098.045210
old       1047.255478
Name: salary, dtype: float64

In [21]:
df.groupby('age_cat')['salary'].describe()

,count,mean,std,min,25%,50%,75%,max
age_cat,,,,,,,,
young,84.0,2176.059524,1040.247241,553.0,1364.5,2065.0,2993.75,4508.0
middle,616.0,2289.563312,1098.045210,553.0,1366.0,2179.0,3024.50,5550.0
old,300.0,2114.336667,1047.255478,553.0,1252.0,2065.0,2875.75,5435.0